Repository: pkp/sword
Catalog: locale/*/locale.po
Languages: ar_iq, ca_es, cs_cz

# plugins.generic.sword.displayName
source: SWORD Client Plugin
ar_iq: إضافة عميل SWORD
ca_es: Mòdul SWORD
cs_cz: Plugin SWORD

# plugins.generic.sword.description
source: Allow Managers and (optionally) Authors to deposit submissions via the SWORD protocol
ar_iq: يتيح لرؤساء التحرير ومدرائه و(اختيارياً) المؤلفين، إيداع طلبات التقديم باستعمال بروتوكول SWORD
ca_es: Permetre als administradors/ores i als autors/ores (opcionalment) dipositar trameses mitjançant el protocol SWORD
cs_cz: Umožňuje manažerům časopisu a (volitelně) autorům ukládat příspěvky pomocí protokolu SWORD

# plugins.generic.sword.descriptionUnsupported
source: Allow Managers and (optionally) Authors to deposit submissions via the SWORD protocol. Note that this plugin requires the Zip extension, which is currently NOT installed.
ar_iq: يتيح لرؤساء التحرير ومدرائه و(اختيارياً) المؤلفين، إيداع طلبات التقديم باستعمال بروتوكول SWORD. لاحظ أن هذه الإضافة تتطلب وجود إمتداد Zip، والذي هو حالياً غير منصب.
ca_es: Permetre als administradors/ores i als autors/ores (opcionalment) dipositar trameses mitjançant el protocol SWORD. S'ha de tenir en compte que aquest mòdul requereix l'extensió Zip, que actualment no està instal·lada.
cs_cz: Umožňuje manažerům časopisu a (volitelně) autorům ukládat příspěvky pomocí protokolu SWORD. Tento plugin vyžaduje rozšíření Zip, které není na vašem serveru v tomto momentě nainstalováno.

# plugins.generic.sword.enabled
source: The SWORD plugin has been enabled.
ar_iq: تم تمكين إضافة SWORD.
ca_es: S'ha activat el mòdulor SWORD.
cs_cz: Plugin SWORD byl povolen.

# plugins.generic.sword.settings
source: Settings
ar_iq: الإعدادات
ca_es: Configuració
cs_cz: Nastavení

# plugins.generic.sword.settings.allowAuthorSpecify
source: Allow the author to specify a deposit point
ar_iq: يتيح للمؤلف تحديد نقطة الإيداع
ca_es: Permetre a l'autor/a especificar un punt de dipòsit
cs_cz: Umožňuje autorům specifikovat bod ukládání

# plugins.generic.sword.settings.depositPoints
source: Deposit Points
ar_iq: نقاط الإيداع
ca_es: Punts de dipòsit
cs_cz: Bod ukládání

# plugins.generic.sword.depositPoints.create
source: Create Deposit Point
ar_iq: إنشاء نقطة إيداع
ca_es: Crear un punt de dipòsit
cs_cz: Vytvořit bod ukládání

# plugins.generic.sword.depositPoints.edit
source: Edit Deposit Point
ar_iq: تعديل نقطة الإيداع
ca_es: Editar un punt de dipòsit
cs_cz: Upravit bod ukládání

# plugins.generic.sword.depositPoints.type.automatic
source: Automatic
ar_iq: تلقائية
ca_es: Automàtic
cs_cz: Automaticky

# plugins.generic.sword.depositPoints.type.optionalSelection
source: Optional; Flexible
ar_iq: إختيارية؛ مرنة
ca_es: Opcional; Flexible
cs_cz: Volitelný; Flexibilní

# plugins.generic.sword.depositPoints.type.optionalFixed
source: Optional; Fixed
ar_iq: إختيارية؛ ثابتة
ca_es: Opcional; Fix
cs_cz: Volitelný; Pevný

# plugins.generic.sword.depositPoints.type.manager
source: Manager Only
ar_iq: رئيس التحرير حصراً
ca_es: Només per a l'administrador/a
cs_cz: Pouze manažer

# plugins.generic.sword.depositPoints.type.description
source: <h4>Deposit Point Types:</h4> <p><strong>Automatic</strong>: The deposit occurs automatically. The full SWORD collection IRI is specified. A username and password must be specified. Deposit occurs after notifying the author of acceptance.<br/> <strong>Optional; Flexible</strong>: The author can choose whether or not to deposit. The specified IRI indicates a service document, and the author may choose which collection to deposit to from that list. Deposit occurs after notifying the author of acceptance.<br/> <strong>Optional; Fixed</strong>: The author can choose whether or not to deposit. The URL specifies the collection IRI. Deposit occurs after notifying the author of acceptance.<br/> <strong>Manager Only</strong>: Only the Manager may use this deposit point. The SWORD service document IRI is specified. Deposit is manually performed by the Manager using the Import/Export interface. </p>
ar_iq: <h4>أنواع نقاط الإيداع:</h4> <p><strong>تلقائية</strong>: يحدث الإيداع بشكل آلي. يتم تحديد نقطة الإيداع الكاملة لـ SWORD. ينبغي هنا تحديد اسم الدخول وكلمة المرور. يحصل الإيداع بعد إشعار المؤلف بالقبول.<br/> <strong>إختيارية؛ مرنة</strong>: يمكن للمؤلف التخير بين الإيداع من عدمه. رابط الإنترنت المحدد يشير إلى وثيقة خدمة، ويمكن للمؤلف إختيار أي من نقاط الإيداع المحددة لاستعمالها من تلك الوثيقة. يحصل الإيداع بعد إشعار المؤلف بالقبول.<br/> <strong>إختيارية؛ ثابتة</strong>: يمكن للمؤلف التخير بين الإيداع من عدمه. رابط الإنترنت يحدد نقطة إيداع SWORD. يحصل الإيداع بعد إشعار المؤلف بالقبول.<br/> <strong>رئيس التحرير حصراً</strong>: للرئيس حصراً حق استعمال نقطة الإيداع هذه. رابط الإنترنت يحدد وثيقة الخدمة. يحصل الإيداع يدوياً من قبل الرئيس عبر استعماله لواجهة الاستيراد/التصدير. </p>
ca_es: <h4>Tipus de punt de dipòsit:</h4> <p><strong>Automàtic</strong>: El dipòsit es produeix de forma automàtica. S'indica el punt de dipòsit SWORD complet. Ha d'indicar un nom d'usuari/ària i una contrasenya. El dipòsit es produeix després de notificar la confirmació a l'autor/a.<br/> <strong>Opcional; Flexible</strong>: L'autor/a pot decidir si voleu dipositar o no. L'URL facilitat ofereix un document de servei i l'autor/a pot decidir quin punt de dipòsit concret utilitzar d'aquest document. El dipòsit es produeix després de notificar la confirmació a l'autor/a.<br/> <strong>Opcional; Fix</strong>: L'autor/a pot decidir si vol dipositar o no. L'URL indica el punt de dipòsit SWORD concret. El dipòsit es produeix després de notificar la confirmació a l'autor/a.<br/> <strong>Només per a l'administrador/a</strong>: Només l'administrador/a pot usar aquest punt de dipòsit. L'URL indica un document de servei. L'administrador/a realitza el dipòsit manualment utilitzant la interfície d'Importació/Exportació.</p>
cs_cz: <h4>Typy bodu ukládání:</h4> <p><strong>Automatický</strong>: Úložiště se objevuje automaticky. Je plně definováno místo SWORD úložiště. Musí být zadány login a heslo. Místo uložení se objeví po upozornění autora o přijetí.<br/> <strong>Volitelné; Flexibilní</strong>: Autor se může rozhodnout, zda uložit, či ne. URL ukazuje servisní dokument a autor se může rozhodnout, které specifické místo uložení použije. Místo uložení se objeví po upozornění autora o přijetí.<br/> <strong>Volitelný; Pevný</strong>: Autor se může rozhodnou, zda uložit, či ne. URL určuje specifické místo SWORD úložiště. Místo uložení se objeví po upozornění autora o přijetí.<br/> <strong>Pouze manažer</strong>: Pouze manažer může používat toto ukládací místo. URL indikuje servisní dokument. Uložení je prováděno manuálně manažerem pomocí rozhraní Import/Export interface. </p>

# plugins.generic.sword.depositPoints.password.description
source: If you do not specify a password here, you and/or the author will be prompted for one when the deposit occurs. Note that this password will be visible to all Managers and will be stored unencrypted in the database.
ar_iq: إن لم تحدد كلمة المرور هنا، ستتم مطالبتك و/أو المؤلف بتقديمها عند حصول الإيداع. لاحظ أن تلك الكلمة ستكون مرئية لكل المدراء وستم حفظها بشكل صريح (غير مشفر) في قاعدة البيانات.
ca_es: Si no indiqueu una contrasenya aquí, haureu d'introduir-ne una quan l'autor/a o vostè mateix feu el dipòsit. Tingueu en compte que aquesta contrasenya serà visible per a tots els administradors/ores i es guardarà sense encriptar a la base de dades.
cs_cz: Pokud zde nevložíte heslo, vy a/nebo autor bude tázán na heslo vždy když se objeví místo pro ukládání. Vemte na vědomí, že heslo bude viditelné všem manažerům a bude uloženo v databázi nezašifrované.

# plugins.generic.sword.depositPoints.name
source: Name
ar_iq: الاسم
ca_es: Nom
cs_cz: Jméno

# plugins.generic.sword.automaticDepositComplete
source: The item "{$itemTitle}" was automatically deposited into the repository "{$repositoryName}".
ar_iq: الفقرة "{$itemTitle}" تم إيداعها تلقائياً في المستودع "{$repositoryName}".
ca_es: L'element "{$itemTitle}" s'ha dipositat automàticament al dipòsit "{$repositoryName}".
cs_cz: Položka "{$itemTitle}" byla automaticky uložena do repozitáře "{$repositoryName}".

# plugins.generic.sword.depositComplete
source: The item "{$itemTitle}" was deposited into the repository "{$repositoryName}".
ar_iq: الفقرة "{$itemTitle}" تم إيداعها في المستودع "{$repositoryName}".
ca_es: L'element "{$itemTitle}" s'ha dipositat al repositori "{$repositoryName}".
cs_cz: Položka "{$itemTitle}" byla uložena do repozitáře "{$repositoryName}".

# plugins.generic.sword.authorDepositDescription
source: <p>You may optionally use the following form to deposit your submission, "{$submissionTitle}", in one of the repositories listed. Use the checkboxes down the left-hand column to select which repositories you wish to deposit your submission into; each repository may also allow you to specify a collection from a pull-down list.</p>
ar_iq: <p>بإمكانك إختيارياً استعمال النموذج الآتي لإيداع طلبك للنشر الموسوم "{$submissionTitle}"، في واحد من المستودعات المدرجة. استعمل خانات الاختيار أسفل العمود الأيسر لاختيار أي من تلك المستودعات التي ترغب في حفظ طلبك فيها؛ كل مستودع قد يقدم لك أيضاً قائمة منسدلة بنقاط الإيداع لتختار منها.</p>
ca_es: <p> Si ho desitja, pot utilitzar el següent formulari per dipositarla seva tramesa "{$submissionTitle}" en un dels dipòsits de la llista. Per a seleccionar en quin repositori desitja dipositar la tramesa, utilitzeu les caselles de verificació situades a la part inferior de la columna esquerra. Cada dipòsit permet triar un punt de dipòsit d'una llista desplegable.</p>
cs_cz: <p>Máte možnost použít následující formulář k uložené vašeho příspěvku, "{$submissionTitle}", v jednom z repozitářů z následujícího seznamu. Použijte zatrhávací políčka níže v levém sloupci, abyste si vybrali ve kterém z repozitářů chcete článek uložit; každý z repozitářů vám může také umožnit specifikovat vstupní bod z rozbalovacího seznamu.</p>

# plugins.generic.sword.authorCustomDepositDescription
source: <p>You may optionally specify a SWORD-compliant deposit point in the following form. If desired, please specify a SWORD URL, username and password to your repository and the submission will be deposited.</p>
ar_iq: <p>بإمكانك إختيارياً تحديد نقطة إيداع متوافقة مع SWORD في النموذج الآتي. إن رغبت في هذا، لطفاً، حدد رابط الإنترنت، اسم المستخدم، وكلمة المرور لمستودعك ليتم استعمالها عند حفظ طلبك للنشر.</p>
ca_es: <p> Si ho desitja, pot indicar un punt de dipòsit compatible amb SWORD en el següent formulari. Per a això, indiqueu un URL, nom d'usuari/ària i contrasenya de SWORD al dipòsit i es dipositarà la tramesa.</p>
cs_cz: <p>Volitelně můžete specifikovat vstupní bod úložiště, který je v souladu s SWORD formátem. Pokud je to žádoucí, specifikujte URL SWORDU, uživatelské jméno a heslo k vašemu repozitáři - váš příspěvek bude uložen.</p>

# plugins.importexport.sword.displayName
source: SWORD Import/Export Deposit Plugin
ar_iq: الاستيراد/التصدير لإضافة الإيداع SWORD
ca_es: Mòdul de dipòsit d'importació/exportació SWORD
cs_cz: Plugin pro Import/Export do SWORD repozitářů

# plugins.importexport.sword.description
source: Deposit submissions in remote repositories using the SWORD deposit protocol
ar_iq: إيداع طلبات التقديم في مستودعات خارجية باستعمال بروتوكول الإيداع SWORD
ca_es: Dipositar trameses en repositoris remots mitjançant el protocol de dipòsit SWORD
cs_cz: Uložte příspěvky do vzdálených repoziřářů s použitím protokolu SWORD

# plugins.importexport.sword.deposit
source: Deposit
ar_iq: إيداع
ca_es: Dipòsit
cs_cz: Úložiště

# plugins.importexport.sword.serviceDocUrl
source: Service Document URL
ar_iq: رابط الإنترنت لوثيقة الخدمة
ca_es: URL del document de servei
cs_cz: URL servisního dokumentu

# plugins.importexport.sword.depositUrl
source: Deposit Point URL
ar_iq: رابط الإنترنت لنقطة الإيداع
ca_es: URL del punt de dipòsit
cs_cz: URL místa uložení

# plugins.importexport.sword.depositPoint
source: Deposit Point
ar_iq: نقطة الإيداع
ca_es: Punts de dipòsit
cs_cz: Místo ukládání

# plugins.importexport.sword.depositPoint.addRemove
source: Add/Remove
ar_iq: إضافة/حذف
ca_es: Afegeix/Suprimeix
cs_cz: Přidat/odebrat

# plugins.importexport.sword.depositGalleys
source: Deposit Galleys
ar_iq: ألواح الإيداع
ca_es: Diposita galerades
cs_cz: Uložit sazebnice

# plugins.importexport.sword.depositEditorial
source: Deposit Most Recent Editorial File
ar_iq: إيداع أحدث ملفات التحرير
ca_es: Diposita els arxius d'editorial més recents
cs_cz: Uložit nejnovější redakční soubor

# plugins.importexport.sword.depositSuccessful
source: Deposit Successful
ar_iq: تم الإيداع بنجاح
ca_es: Dipòsit correcte
cs_cz: Úspěšné uložení

# plugins.importexport.sword.depositSuccessfulDescription
source: The item(s) selected have been deposited.
ar_iq: الفقرات المحددة قد تم إيداعها.
ca_es: Els elements seleccionats s'han dipositat.
cs_cz: Vybrané položky byly uloženy.

# plugins.importexport.sword.depositFailed
source: Deposit Failed
ar_iq: فشلت عملية الإيداع
ca_es: Dipòsit erroni
cs_cz: Uložení selhalo

# plugins.generic.sword.badDepositPointUrl
source: Please check the url of the deposit point.
ar_iq: لطفاً، تحقق من صحة رابط نقطة الإيداع.
ca_es: Comproveu l'URL del punt de dipòsit.
cs_cz: Zkontrolujte adresu URL místa uložení.

# plugins.generic.sword.manager.noneCreated
source: No deposit points have been created.
ar_iq: لم يتم إنشاء نقاط إيداع بعد.
ca_es: No s'ha creat cap punt de dipòsit.
cs_cz: Nebyly vytvořeny žádné vkladové body.

# plugins.generic.sword.settings.saved
source: Settings saved!
ar_iq: الإعدادات حفظت بنجاح!
ca_es: Configuració guardada!
cs_cz: Nastavení uloženo!

# plugins.importexport.sword.requiredFieldErrorMessage
source: Please select at least one submission to deposit.
ar_iq: لطفاً، إختر طلب تقديم واحد على الأقل لإيداعه.
ca_es: Seleccioneu com a mínim una tramesa per depositar.
cs_cz: Vyberte alespoň jeden příspěvek k uložení.

# plugins.importexport.sword.requiredFieldErrorTitle
source: Submission required
ar_iq: طلب التقديم مطلوب
ca_es: Tramesa sol·licitada
cs_cz: Vyžaduje se podání příspěvku

# plugins.importexport.sword.apikey
source: API Key
ar_iq: مفتاح API
ca_es: Clau API
cs_cz: Klíč API

# plugins.generic.sword.depositPoints.apikey
source: API Key
ar_iq: مفتاح API
ca_es: Clau API
cs_cz: Klíč API

# plugins.importexport.sword.reload
source: Reload
ar_iq: إعادة التحميل
ca_es: Recarregar
cs_cz: Znovu načíst

# plugins.generic.sword.depositPoints.description
source: Description
ar_iq: الوصف
ca_es: Descripció
cs_cz: Popis

# plugins.generic.sword.depositPoints.leaveBlank
source: If this field is left blank, it will be requested when the deposit is made.
ar_iq: إذا تُرك هذا الحقل فارغًا، ستتم المطالبة به عند إجراء الإيداع.
ca_es: Si aquest camp es deixa en blanc, quan es faci el dipòsit se us demanarà.
cs_cz: Pokud toto pole zůstane prázdné, bude požadováno při provedení vkladu.

# plugins.generic.sword.settings.showDepositButton
source: Present authors with a "Deposit" button on their submission
ar_iq: توفير زر "الإيداع" للمؤلفين عند طلب تقديمهم
cs_cz: Prezentovat autorům tlačítko „Deposit (zálohovat)“ pro jejich příspěvek

# plugins.generic.sword.accessDenied
source: (Please check your credentials above)
ar_iq: (الوصول ممنوع)
cs_cz: (Přístup zakázán)

# plugins.generic.sword.depositsComplete
source: The following deposit(s) were successfully completed:
ar_iq: الإيداعات الآتية اكتملت بنجاح:
